app/controllers/members_controller.rb

SELECT  "members".* FROM "members" ORDER BY number LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "members"
---
  def index
    @members = Member.order("number")
      .page(params[:page]).per(15)