app/controllers/members_controller.rb

SELECT "members".* FROM "members" ORDER BY number
---
  def index
    @members = Member.order("number")

INSERT INTO "members" ("number", "name", "full_name", "email", "birthday", "sex", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @member = Member.new(params[:member])
    if @member.save

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "members" SET "number" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["number", 30], ["updated_at", "2018-09-11 14:42:26.257256"], ["id", 11]]
---
  def update
    @member = Member.find(params[:id])
    @member.assign_attributes(params[:member])
    if @member.save

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 11]]
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy

SELECT "members".* FROM "members" WHERE (name LIKE '%佐藤%' OR full_name LIKE '%佐藤%') ORDER BY number
---
  def search
    @members = Member.search(params[:q])